# ElementHasMultipleConnectors Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..ElementHasMultipleConnectors Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Revit found one or more elements with multiple connectors. Select each element and then select the connectors to use for the analytical connection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementHasMultipleConnectors { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementHasMultipleConnectors As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementHasMultipleConnectors {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace